# Distributed revision control system
brew "git"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
cask "font-meslo-lg-nerd-font"
# Control your tools with a few keystrokes
cask "raycast"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "andys8.jest-snippets"
vscode "anthropic.claude-code"
vscode "chakrounanas.turbo-console-log"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "dbaeumer.vscode-eslint"
vscode "esbenp.prettier-vscode"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "mylesmurphy.prettify-ts"
vscode "naumovs.color-highlight"
vscode "pkief.material-icon-theme"
vscode "pmneo.tsimporter"
vscode "streetsidesoftware.code-spell-checker"
vscode "usernamehw.errorlens"
vscode "vincaslt.highlight-matching-tag"
vscode "wallabyjs.console-ninja"
vscode "wallabyjs.quokka-vscode"
vscode "wix.vscode-import-cost"
vscode "xabikos.javascriptsnippets"
vscode "yoavbls.pretty-ts-errors"
npm "typescript"

# インストール済みだったため、手動で追加
cask "google-chrome"
cask "chatgpt"
cask "visual-studio-code"